OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net.isWifiModeAp()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += net.getIp();

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleHttpsRedirect(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_HTML);

  String url = F("https://");
  url += request->host().toString();
  url += request->uri().toString();

  String s = F("<html>");
  s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
  s += url;
  s += F("\" /></head><body><a href=\"");
  s += url;
  s += F("\">OpenEVSE</a></body></html>");

  response->setCode(301);
  response->addHeader(F("Location"), url);
  response->print(s);
  request->send(response);
}

void onWsFrame(MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len)
{
  DBUGF("Got message %.*s", len, (const char *)data);
  const size_t capacity = JSON_OBJECT_SIZE(1) + 16;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, data, len);
  if (!error) {
    if (doc.containsKey("ping") && doc["ping"].is<int8_t>())
      {
        // answer pong
        connection->send("{\"pong\": 1}");

      }
  }
}

void onWsConnect(MongooseHttpWebSocketConnection *connection)
{
  DBUGF("New client connected over ws");
  // pushing states to client
  const size_t capacity = JSON_OBJECT_SIZE(40) + 1024;
  DynamicJsonDocument doc(capacity);
  buildStatus(doc);
  web_server_event(doc);
}

/*
 * Really simple 'conversion' of ASCII to UTF-8, basically only a few places send >127 chars
 * so just filter those to be acceptable as UTF-8
 */
void web_server_send_ascii_utf8(const char *endpoint, const uint8_t *buffer, size_t size)
{
  char temp[size];
  for(int i = 0; i < size; i++) {
    temp[i] = buffer[i] & 0x7f;
  }
  server.sendAll(endpoint, WEBSOCKET_OP_TEXT, temp, size);
}

void handleMqttAction(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response)) return;

  if (HTTP_GET == request->method()) {
    DynamicJsonDocument doc(JSON_OBJECT_SIZE(8) + 384);
    doc["mqtt_connected"] = (int)mqtt.isConnected();
    doc["mqtt_status"]    = mqtt.getMqttStatus();
    if (mqtt.getBrokerIp()[0] != '\0')
      doc["mqtt_broker_ip"]      = mqtt.getBrokerIp();
    if (mqtt.getBrokerVersion()[0] != '\0')
      doc["mqtt_broker_version"] = mqtt.getBrokerVersion();
    if (mqtt.getConnectedSince() > 0)
      doc["mqtt_connected_since"] = (uint32_t)mqtt.getConnectedSince();
    if (mqtt.getLastRxTime() > 0)
      doc["mqtt_last_rx"]         = (uint32_t)mqtt.getLastRxTime();
    // Always include error fields (empty string when no failure) so the GUI can
    // clear a previously-shown reason once reconnected.
    doc["mqtt_error"]        = mqtt.getErrorCategory();
    doc["mqtt_error_detail"] = mqtt.getErrorDetail();
    response->setCode(200);
    serializeJson(doc, *response);
  } else if (HTTP_POST == request->method()) {
    mqtt.restartConnection();
    response->setCode(200);
    response->print("{\"msg\":\"done\"}");
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }
  request->send(response);
}

// MongooseHttpServer::on() attaches each route to whichever mg_connection*
// the server's `nc` member currently points at (mg_register_http_endpoint(nc,
// ...) — see MongooseHttpServer.cpp) — i.e. routes are per-LISTENER, not
// server-instance-wide, even though `server` is a single C++ object. Calling
// server.begin() twice (once per port) and registering routes only once
// after both binds would attach every route only to the second (most
// recent) listener, leaving the first with none — exactly the 404-on-HTTPS
// bug this was split out to fix. So this whole block runs once per listener
// (see web_server_setup() below).
static void registerWebServerRoutes()
{
  // Handle status updates
  server.on("/status$", handleStatus);
  server.on("/config$", handleConfig);

  // Handle HTTP web interface button presses
  server.on("/teslaveh$", handleTeslaVeh);
  server.on("/tesla/vehicles$", handleTeslaVeh);
  server.on("/settime$", handleSetTime);
  server.on("/reset$", handleRst);
  server.on("/restart$", handleRestart);
  server.on("/rapi$", handleRapi);
  server.on("/r$", handleRapi);
  server.on("/scan$", handleScan);
  server.on("/apoff$", handleAPOff);
  server.on("/divertmode$", handleDivertMode);
  server.on("/shaper$", handleCurrentShaper);
  server.on("/emoncms/describe$", handleDescribe);
  server.on("/rfid/add$", handleAddRFID);

  server.on("/schedule/plan$", handleSchedulePlan);
  server.on("/schedule", handleSchedule);

  server.on("/claims/target$", handleEvseClaimsTarget);
  server.on("/claims", handleEvseClaims);

  server.on("/override$", handleOverride);

  server.on("/logs", handleEventLogs);
  server.on("/certificates", handleCertificates);
  server.on("/limit", handleLimit);
  server.on("/emeter", handleEmeter);
  server.on("/time", handleTime);
  server.on("/mqtt$", handleMqttAction);

#ifndef ENABLE_TSDB
  server.on("/energy/raw$", handleEnergyRaw);
  server.on("/energy/daily$", handleEnergyDaily);
  server.on("/energy/monthly$", handleEnergyMonthly);
  server.on("/energy/annual$", handleEnergyAnnual);
#else // ENABLE_TSDB
  server.on("/energy/raw$", handleEnergyRaw);
  server.on("/energy/daily$", handleEnergyDaily);
  server.on("/energy/weekly$", handleEnergyWeekly);
  server.on("/energy/monthly$", handleEnergyMonthly);
  server.on("/energy/annual$", handleEnergyAnnual);
#endif // ENABLE_TSDB

  // Simple Firmware Update Form
  server.on("/update$")->
    onRequest(handleUpdateRequest)->
    onUpload(handleUpdateUpload)->
    onClose(handleUpdateClose);

  // In-place 16MB flash repartition (16MB module flashed with 4MB layout)
  server.on("/migrate/expand16mb$", handleMigrateExpand16mb);
  server.on("/migrate/status$", handleMigrateStatus);
  server.on("/migrate/coredump$", handleMigrateCoredump);

